#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.archive_file.test_results_display: Reading...
data.archive_file.image_submission_handler: Reading...
data.archive_file.test_page_list: Reading...
data.archive_file.test_page_redirect: Reading...
data.archive_file.image_submission_handler: Read complete after 0s [id=49ae011c1ff68fbc5d11ba0fd3856abee2722b24]
data.archive_file.test_results_display: Read complete after 0s [id=8a7fcd04975fd6d2dd2932429bfc9c1f54ee041c]
data.archive_file.test_page_list: Read complete after 0s [id=719bc4d91300cdb4a7a6d337c5bbad946defadcb]
data.archive_file.test_page_redirect: Read complete after 0s [id=0adc349b710f2c4b423682303f12c68609d502ba]
module.prod_site.aws_acm_certificate.phlask_site: Refreshing state... [id=arn:aws:acm:us-east-1:710438357722:certificate/ece470f1-c6ab-4d7b-8ab2-19c2fff629df]
module.beta_site.aws_acm_certificate.phlask_site: Refreshing state... [id=arn:aws:acm:us-east-1:710438357722:certificate/a075f6e8-7b43-4e15-b7b6-777502baf602]
aws_dynamodb_table.test_page_list: Refreshing state... [id=test-page-list]
module.test_site.aws_acm_certificate.phlask_site: Refreshing state... [id=arn:aws:acm:us-east-1:710438357722:certificate/bdba85cb-2e8f-4c5b-94f1-77918e5ae571]
aws_s3_bucket.logs: Refreshing state... [id=phlask-logs]
aws_iam_role.test_page_redirect: Refreshing state... [id=test-page-redirect]
aws_cloudfront_function.www_redirect: Refreshing state... [id=www-redirect]
module.beta_site.data.aws_cloudfront_origin_access_identity.images: Reading...
module.beta_site.data.aws_s3_bucket.phlask_images: Reading...
data.aws_iam_policy.AWSLambdaBasicExecutionRole: Reading...
module.beta_site.data.aws_s3_bucket.phlask_logs: Reading...
module.test_site.data.aws_s3_bucket.phlask_logs: Reading...
module.prod_site.aws_s3_bucket.phlask_site: Refreshing state... [id=phlask.me]
module.prod_site.data.aws_s3_bucket.phlask_images: Reading...
module.beta_site.data.aws_cloudfront_origin_access_identity.images: Read complete after 0s [id=EYLKT3B3LMJM1]
module.prod_site.data.aws_cloudfront_origin_access_identity.images: Reading...
module.test_site.aws_s3_bucket.phlask_site: Refreshing state... [id=test.phlask.me]
module.prod_site.data.aws_cloudfront_origin_access_identity.images: Read complete after 1s [id=EYLKT3B3LMJM1]
aws_s3_bucket.images: Refreshing state... [id=phlask-tap-images]
module.beta_site.data.aws_s3_bucket.phlask_images: Read complete after 1s [id=phlask-tap-images]
aws_iam_role.image_submission_handler: Refreshing state... [id=image-submission-handler]
module.beta_site.data.aws_s3_bucket.phlask_logs: Read complete after 1s [id=phlask-logs]
module.prod_site.data.aws_s3_bucket.phlask_logs: Reading...
module.prod_site.data.aws_s3_bucket.phlask_images: Read complete after 1s [id=phlask-tap-images]
module.test_site.data.aws_s3_bucket.phlask_images: Reading...
module.test_site.data.aws_s3_bucket.phlask_logs: Read complete after 1s [id=phlask-logs]
aws_iam_role.test_page_list: Refreshing state... [id=test-page-list]
module.prod_site.data.aws_s3_bucket.phlask_logs: Read complete after 0s [id=phlask-logs]
data.aws_cloudfront_origin_request_policy.s3_origin: Reading...
module.test_site.data.aws_s3_bucket.phlask_images: Read complete after 0s [id=phlask-tap-images]
data.aws_caller_identity.current: Reading...
data.aws_cloudfront_origin_request_policy.s3_origin: Read complete after 0s [id=88a5eaf4-2fd4-4709-b370-b4c650ea3fcf]
data.aws_cloudfront_origin_access_identity.images: Reading...
data.aws_cloudfront_cache_policy.caching_optimized: Reading...
module.test_site.data.aws_cloudfront_origin_access_identity.images: Reading...
data.aws_iam_policy.AWSLambdaBasicExecutionRole: Read complete after 1s [id=arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole]
module.beta_site.aws_s3_bucket.phlask_site: Refreshing state... [id=beta.phlask.me]
data.aws_caller_identity.current: Read complete after 0s [id=710438357722]
aws_lambda_function.test_page_redirect: Refreshing state... [id=test-page-redirect]
data.aws_cloudfront_origin_access_identity.images: Read complete after 0s [id=EYLKT3B3LMJM1]
aws_lambda_function.image_submission_handler: Refreshing state... [id=image-submission-handler]
data.aws_cloudfront_cache_policy.caching_optimized: Read complete after 0s [id=658327ea-f89d-4fab-a63d-7e88639e58f6]
aws_lambda_function.test_results_display: Refreshing state... [id=test-results-display]
aws_lambda_function.test_page_list: Refreshing state... [id=test-page-list]
aws_iam_role_policy.test_page_list: Refreshing state... [id=test-page-list:test-bucket-access]
module.test_site.data.aws_cloudfront_origin_access_identity.images: Read complete after 0s [id=EYLKT3B3LMJM1]
aws_iam_role_policy_attachment.test_page_list: Refreshing state... [id=test-page-list-20221126042718794000000004]
aws_iam_role_policy_attachment.image_submission_handler: Refreshing state... [id=image-submission-handler-arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole]
aws_iam_role_policy_attachment.test_page_redirect: Refreshing state... [id=test-page-redirect-20221126162835357000000001]
aws_iam_policy.test_page_list_dynamodb_access: Refreshing state... [id=arn:aws:iam::710438357722:policy/DynamoDBAccess]
aws_s3_bucket_ownership_controls.logs: Refreshing state... [id=phlask-logs]
aws_iam_role_policy.image_submission_handler: Refreshing state... [id=image-submission-handler:bucket_access]
data.aws_iam_policy_document.images: Reading...
aws_s3_bucket_lifecycle_configuration.images: Refreshing state... [id=phlask-tap-images]
data.aws_iam_policy_document.images: Read complete after 0s [id=3328870480]
aws_s3_bucket_cors_configuration.images: Refreshing state... [id=phlask-tap-images]
aws_s3_bucket_acl.images: Refreshing state... [id=phlask-tap-images,private]
aws_s3_bucket_policy.images: Refreshing state... [id=phlask-tap-images]
module.prod_site.aws_s3_bucket_acl.phlask_site: Refreshing state... [id=phlask.me,public-read]
module.prod_site.aws_s3_bucket_public_access_block.phlask_site: Refreshing state... [id=phlask.me]
module.prod_site.data.aws_iam_policy_document.phlask_site: Reading...
module.prod_site.aws_s3_bucket_website_configuration.phlask_site: Refreshing state... [id=phlask.me]
module.test_site.aws_s3_bucket_acl.phlask_site: Refreshing state... [id=test.phlask.me,public-read]
module.prod_site.data.aws_iam_policy_document.phlask_site: Read complete after 0s [id=3580706049]
module.test_site.aws_s3_bucket_public_access_block.phlask_site: Refreshing state... [id=test.phlask.me]
aws_iam_role_policy_attachment.test_page_list_dynamodb_access: Refreshing state... [id=test-page-list-arn:aws:iam::710438357722:policy/DynamoDBAccess]
module.test_site.aws_s3_bucket_website_configuration.phlask_site: Refreshing state... [id=test.phlask.me]
module.test_site.data.aws_iam_policy_document.phlask_site: Reading...
module.test_site.data.aws_iam_policy_document.phlask_site: Read complete after 0s [id=3191198811]
module.prod_site.aws_s3_bucket_policy.phlask_site: Refreshing state... [id=phlask.me]
module.test_site.aws_s3_bucket_policy.phlask_site: Refreshing state... [id=test.phlask.me]
module.prod_site.aws_cloudfront_distribution.phlask_site: Refreshing state... [id=E1973YRMECWO5I]
module.test_site.aws_cloudfront_distribution.phlask_site: Refreshing state... [id=E3IKKIS9LTKQD]
module.beta_site.aws_s3_bucket_acl.phlask_site: Refreshing state... [id=beta.phlask.me,public-read]
module.beta_site.aws_s3_bucket_public_access_block.phlask_site: Refreshing state... [id=beta.phlask.me]
module.beta_site.data.aws_iam_policy_document.phlask_site: Reading...
module.beta_site.aws_s3_bucket_website_configuration.phlask_site: Refreshing state... [id=beta.phlask.me]
module.beta_site.data.aws_iam_policy_document.phlask_site: Read complete after 0s [id=2073274897]
module.beta_site.aws_s3_bucket_policy.phlask_site: Refreshing state... [id=beta.phlask.me]
module.beta_site.aws_cloudfront_distribution.phlask_site: Refreshing state... [id=EYFMESNC9X208]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_lambda_function.test_page_list has changed
  ~ resource "aws_lambda_function" "test_page_list" {
        id                             = "test-page-list"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:710438357722:function:test-page-list:17" -> "arn:aws:lambda:us-east-1:710438357722:function:test-page-list:18"
        tags                           = {
            "Terraform" = "true"
        }
        # (20 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # aws_lambda_function.test_page_list will be updated in-place
  ~ resource "aws_lambda_function" "test_page_list" {
        id                             = "test-page-list"
      ~ last_modified                  = "2023-02-25T21:01:08.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:710438357722:function:test-page-list:18" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:710438357722:function:test-page-list:18/invocations" -> (known after apply)
      ~ source_code_hash               = "JNq+0UimcUU8jDQIpmQXB1rFKNnQ7rTWDaLHz1z28/A=" -> "8758Cet0oh+AT0ZLESFf+4DAk8A24pNj+Gw25kE0QEI="
        tags                           = {
            "Terraform" = "true"
        }
      ~ version                        = "18" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.test_site.aws_cloudfront_distribution.phlask_site will be updated in-place
  ~ resource "aws_cloudfront_distribution" "phlask_site" {
        id                             = "E3IKKIS9LTKQD"
        tags                           = {
            "Environment" = "test"
            "Terraform"   = "true"
        }
        # (18 unchanged attributes hidden)

      ~ ordered_cache_behavior {
            # (12 unchanged attributes hidden)

          - lambda_function_association {
              - event_type   = "viewer-request" -> null
              - include_body = false -> null
              - lambda_arn   = "arn:aws:lambda:us-east-1:710438357722:function:test-page-list:18" -> null
            }
          + lambda_function_association {
              + event_type   = (known after apply)
              + include_body = (known after apply)
              + lambda_arn   = (known after apply)
            }

            # (1 unchanged block hidden)
        }

        # (10 unchanged blocks hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @gcardonag, Action: `pull_request`, Workflow: `Terraform Plan`*